### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.backend.azurerm_role_assignment.primary_rg_ra will be created
+   resource "azurerm_role_assignment" "primary_rg_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "138b886f-1d1b-444d-a260-8a16e7ddd44d"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = (known after apply)
+       scope                            = "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a/resourceGroups/PrimaryRG"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_role_assignment.primary_sa_container_ra will be created
+   resource "azurerm_role_assignment" "primary_sa_container_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "138b886f-1d1b-444d-a260-8a16e7ddd44d"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Storage Blob Data Contributor"
+       scope                            = "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa1656/blobServices/default/containers/primary-remote-state"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_role_definition.terraform_role will be created
+   resource "azurerm_role_definition" "terraform_role" {
+       assignable_scopes           = [
+           "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a",
        ]
+       description                 = "Allow terraform SP to manage everything except security access and Blueprint actions."
+       id                          = (known after apply)
+       name                        = "terraform-contributor"
+       role_definition_id          = (known after apply)
+       role_definition_resource_id = (known after apply)
+       scope                       = "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a"

+       permissions {
+           actions     = [
+               "*",
            ]
+           not_actions = [
+               "Microsoft.Authorization/*/Delete",
+               "Microsoft.Authorization/*/Write",
+               "Microsoft.Authorization/elevateAccess/Action",
+               "Microsoft.Blueprint/*/write",
+               "Microsoft.Blueprint/*/delete",
            ]
        }
    }

  # module.backend.null_resource.setup-log will be created
+   resource "null_resource" "setup-log" {
+       id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>